_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding_3 (Embedding)      (None, 100, 32)           5552512
_________________________________________________________________
dropout_3 (Dropout)          (None, 100, 32)           0
_________________________________________________________________
conv1d_3 (Conv1D)            (None, 100, 4)            388
_________________________________________________________________
max_pooling1d_3 (MaxPooling1 (None, 17, 4)             0
_________________________________________________________________
flatten_3 (Flatten)          (None, 68)                0
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 69
=================================================================
Total params: 5,552,969
Trainable params: 5,552,969
Non-trainable params: 0
_________________________________________________________________
