_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_2 (Embedding)      (None, 75, 32)            4245632   
_________________________________________________________________
dropout_3 (Dropout)          (None, 75, 32)            0         
_________________________________________________________________
lstm_2 (LSTM)                (None, 75, 32)            8320      
_________________________________________________________________
dropout_4 (Dropout)          (None, 75, 32)            0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 2400)              0         
_________________________________________________________________
dense_2 (Dense)              (None, 1)                 2401      
=================================================================
Total params: 4,256,353
Trainable params: 4,256,353
Non-trainable params: 0
_________________________________________________________________
