_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
embedding_6 (Embedding)      (None, 100, 16)           2254976
_________________________________________________________________
dropout_6 (Dropout)          (None, 100, 16)           0
_________________________________________________________________
conv1d_6 (Conv1D)            (None, 100, 4)            324
_________________________________________________________________
max_pooling1d_6 (MaxPooling1 (None, 17, 4)             0
_________________________________________________________________
flatten_6 (Flatten)          (None, 68)                0
_________________________________________________________________
dense_6 (Dense)              (None, 1)                 69
=================================================================
Total params: 2,255,369
Trainable params: 2,255,369
Non-trainable params: 0
_________________________________________________________________
