_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_3 (Embedding)      (None, 75, 16)            2122816   
_________________________________________________________________
dropout_5 (Dropout)          (None, 75, 16)            0         
_________________________________________________________________
lstm_3 (LSTM)                (None, 75, 16)            2112      
_________________________________________________________________
dropout_6 (Dropout)          (None, 75, 16)            0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 1200)              0         
_________________________________________________________________
dense_3 (Dense)              (None, 1)                 1201      
=================================================================
Total params: 2,126,129
Trainable params: 2,126,129
Non-trainable params: 0
_________________________________________________________________
