_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
embedding_4 (Embedding)      (None, 75, 32)            4245632   
_________________________________________________________________
dropout_6 (Dropout)          (None, 75, 32)            0         
_________________________________________________________________
conv1d_2 (Conv1D)            (None, 75, 4)             388       
_________________________________________________________________
max_pooling1d_2 (MaxPooling1 (None, 13, 4)             0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 52)                0         
_________________________________________________________________
dense_4 (Dense)              (None, 1)                 53        
=================================================================
Total params: 4,246,073
Trainable params: 4,246,073
Non-trainable params: 0
_________________________________________________________________
